waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/SVD/FM33FK5XX.SVD
        <register>
          <name>AFBIR12</name>
          <displayName>AFBIR12</displayName>
          <description>FDCANAcceptanceFilterBasicIDRegister</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIR</name>
              <description>BIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFBIR13</name>
          <displayName>AFBIR13</displayName>
          <description>FDCANAcceptanceFilterBasicIDRegister</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIR</name>
              <description>BIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFBIR14</name>
          <displayName>AFBIR14</displayName>
          <description>FDCANAcceptanceFilterBasicIDRegister</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIR</name>
              <description>BIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFBIR15</name>
          <displayName>AFBIR15</displayName>
          <description>FDCANAcceptanceFilterBasicIDRegister</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIR</name>
              <description>BIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR0F0</name>
          <displayName>AFEIR0F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR1F0</name>
          <displayName>AFEIR1F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR2F0</name>
          <displayName>AFEIR2F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR3F0</name>
          <displayName>AFEIR3F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR4F0</name>
          <displayName>AFEIR4F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR5F0</name>
          <displayName>AFEIR5F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR6F0</name>
          <displayName>AFEIR6F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR7F0</name>
          <displayName>AFEIR7F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR8F0</name>
          <displayName>AFEIR8F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR9F0</name>
          <displayName>AFEIR9F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR10F0</name>
          <displayName>AFEIR10F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR11F0</name>
          <displayName>AFEIR11F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR12F0</name>
          <displayName>AFEIR12F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR13F0</name>
          <displayName>AFEIR13F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR14F0</name>
          <displayName>AFEIR14F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFEIR15F0</name>
          <displayName>AFEIR15F0</displayName>
          <description>FDCANAcceptanceFilterExtendedIDF0Register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIR</name>
              <description>EIR field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
