waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/SVD/FM33FK5XX.SVD
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOB">
      <name>GPIOC</name>
      <baseAddress>0x40000c80</baseAddress>
      <interrupt>
        <name>EXTIC</name>
        <description>EXTIC interrupt</description>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOB">
      <name>GPIOD</name>
      <baseAddress>0x40000cc0</baseAddress>
      <interrupt>
        <name>EXTID</name>
        <description>EXTID interrupt</description>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOB">
      <name>GPIOE</name>
      <baseAddress>0x40000d00</baseAddress>
      <interrupt>
        <name>EXTIE</name>
        <description>EXTIE interrupt</description>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIOB">
      <name>GPIOF</name>
      <baseAddress>0x40000d40</baseAddress>
      <interrupt>
        <name>EXTIF</name>
        <description>EXTIF interrupt</description>
        <value>37</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>GPIO module information</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40000dc0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x144</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WKUPX</name>
        <description>WKUPX interrupt</description>
        <value>51</value>
      </interrupt>
      <registers>
        <register>
          <name>EXTISEL0</name>
          <displayName>EXTISEL0</displayName>
          <description>ExternalInterruptInputSelectRegister0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DSEL</name>
              <description>EXTI_DSEL field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_CSEL</name>
              <description>EXTI_CSEL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_BSEL</name>
              <description>EXTI_BSEL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_ASEL</name>
              <description>EXTI_ASEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTISEL1</name>
          <displayName>EXTISEL1</displayName>
          <description>ExternalInterruptInputSelectRegister1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_FSEL</name>
              <description>EXTI_FSEL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_ESEL</name>
              <description>EXTI_ESEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDS0</name>
          <displayName>EXTIEDS0</displayName>
          <description>ExternalInterruptEdgeSelectandEnableRegister0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI_DEDS</name>
              <description>EXTI_DEDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_CEDS</name>
              <description>EXTI_CEDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_BEDS</name>
              <description>EXTI_BEDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_AEDS</name>
              <description>EXTI_AEDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDS1</name>
          <displayName>EXTIEDS1</displayName>
          <description>ExternalInterruptEdgeSelectandEnableRegister1</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>EXTI_FEDS</name>
              <description>EXTI_FEDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EXTI_EEDS</name>
              <description>EXTI_EEDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIDF</name>
          <displayName>EXTIDF</displayName>
          <description>ExternalInterruptDigitalFilterRegister</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DF</name>
              <description>EXTI_DF field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIISR</name>
          <displayName>EXTIISR</displayName>
          <description>ExternalInterruptandStatusRegister</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI</name>
              <description>EXTI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIDI</name>
          <displayName>EXTIDI</displayName>
          <description>ExternalInterruptDataInputRegister</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTI_DI</name>
              <description>EXTI_DI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FOUTSEL</name>
          <displayName>FOUTSEL</displayName>
          <description>FrequencyOutputSelectRegister</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FOUT2SEL</name>
              <description>FOUT2SEL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FOUT1SEL</name>
              <description>FOUT1SEL field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FOUT0SEL</name>
              <description>FOUT0SEL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PINWKEN</name>
          <displayName>PINWKEN</displayName>
          <description>WakeupEnableRegister</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WKISEL</name>
              <description>WKISEL field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINWKSEL</name>
              <description>PINWKSEL field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PINWKEN</name>
              <description>PINWKEN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
